[
  {
    "path": "posts/2022-06-02-misnomer-marcus-and-the-mystery-of-turnover-misery/",
    "title": "Misnomer Marcus and the Mystery of Turnover Misery",
    "description": "Marcus Smart may not be the NBA's most appropriately named player, but does it matter?",
    "author": [
      {
        "name": "Mike Toolan",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2022-06-02",
    "categories": [],
    "contents": "\r\nThe Celtic’s Marcus Smart has not always shone through as the highest basketball IQ player in the league. Some years ago, Shaquille O’Neal, in his infamous Shaqtin’ a fool series, devoted an entire montage to his flopping antics. Our personal favourite is the Isiah Thomas piggyback:\r\n\r\n\r\nIndeed in game 5 against the Bucks, he nearly single handedly ended the Celtics run to the NBA finals. With Boston leading by a single point in this seemingly crucial game, Smart proceeded to turn an easy defensive rebound into a turnover, had a lay up blocked and dribbled right into a Milwaukee trap, handing them the ball in what was the game’s final action. All of this is even more impressive given that it was achieved within the final 14.2 seconds. And just like that, a slim Celtics lead became a definite loss and the need for a game 7 if they were to progress.\r\n\r\n\r\nBut maybe the important take away is this: the Celtics won the series.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-06-02T01:08:00-04:00",
    "input_file": "misnomer-marcus-and-the-mystery-of-turnover-misery.knit.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Basketball Blog",
    "description": "Welcome to my blog where we outline the intersection of coaching science and basketball",
    "author": [
      {
        "name": "Mike Toolan",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2022-06-01",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-06-02T00:18:34-04:00",
    "input_file": {}
  }
]
