[
  {
    "path": "posts/2022-06-09-key-takeaways-from-game-3-celtics-v-warriors/",
    "title": "Key Takeaways from game 3: Celtics v Warriors",
    "description": "Celtics pick and roll defence improves, Klay finds his range",
    "author": [
      {
        "name": "Mike Toolan",
        "url": {}
      }
    ],
    "date": "2022-06-09",
    "categories": [],
    "contents": "\r\n\r\n\r\nStick to the right\r\nthing, even at a cost\r\nOne of the ‘almost’ turning points in game 3 was the moment Steph\r\nCurry was fouled by Al Horford while making a three.\r\n\r\n\r\nIn an attempt to get contest the shot, Horford rushed towards Curry\r\nafter his defender had set a screen. Unfortunately for Horford, Curry\r\ndrilled the three while also getting caught by the unrushing Horford as\r\nhe made his way back to Earth. After a review, the officials determined\r\nit was a flagrant 1 on Horford and that the Warriors would get a free\r\nthrow and the ball back. This single play was a 7 point swing in favour\r\nof the Warriors and nearly resulted in an unlikely comeback, cutting the\r\nCeltics lead from 9 to 2.\r\nHere’s the thing, Horford was right. Curry has shown time\r\nand again in this series how prolific he is off ball screens and game 3\r\nwas no exception. Any hesitation, gap, or space he can find after\r\nreceiving a screen is equivalent to a wide open three for most other\r\nplayers. Horford, recognizing this, tried in desperation to shut down\r\nthe space, giving up the foul. While this was not the desired result,\r\non average the Celtics were very successful in shutting down\r\nCurry’s attempts from 3 compared to game 1.\r\n\r\nGolden State Warriors 2021-22 shot data\r\nparsed http://www.basketball-reference.com/leagues/NBA_2022_advanced.html\r\nparsed http://www.basketball-reference.com/leagues/NBA_2022_totals.html\r\nAdvanced\r\nTotals\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2022-06-09-key-takeaways-from-game-3-celtics-v-warriors/key-takeaways-from-game-3-celtics-v-warriors_files/figure-html5/Loading libraries and getting data-1.png",
    "last_modified": "2022-06-10T19:55:42-04:00",
    "input_file": "key-takeaways-from-game-3-celtics-v-warriors.knit.md"
  },
  {
    "path": "posts/2022-06-04-key-takeaways-from-game-1/",
    "title": "Key Take Aways From Game 1: Celtics at Warriors",
    "description": "Steph Curry, Al Horford and Tom Cruise.",
    "author": [
      {
        "name": "Mike Toolan",
        "url": {}
      }
    ],
    "date": "2022-06-04",
    "categories": [],
    "contents": "\r\nPayton Pritchard: Do\r\nthe little things well\r\nPritchard is one of the smallest players on the floor and this has\r\nbeen a feature of his career sincecollege.\r\nHowever, against the Warriors he showed how important small details can\r\nbe. While only playing for a grand total of 16 minutes, he managed to\r\nnotch 8 points, had 2 assists and the fourth highest +/- in the game at\r\n+14. When it comes to the finer things, Pritchard illustrated a perfect\r\nexample in the fourth quarter. The Celtics were on defence and deflected\r\nthe ball high into the air. When Brown eventually emerged with the ball,\r\nPritchard, on the weak side of the floor, had 7 other players between\r\nhim and the Warriors basket. He proceeded to beat every one of them in\r\ntransition to receive a pass from Brown and score a wide open layup,\r\nkick starting the Celtics comeback. This tiny detail and unmistakeable\r\neffort perfectly encasulate his impact.\r\nBoston Make Adjustments…\r\nEventually\r\nLong have our frustrations been with the amount of time it takes the\r\nCeltics to make in-game adjustments. In the series against Miami, the\r\nHeat time and again targeted Grant Williams with a Jimmy Butler pick and\r\nroll and Williams - either afraid of Butler coming downhill or under\r\nspecific instruction from the coaches - backed off, giving Butler\r\nplentiful opportunities to finish from the mid-range.\r\nSimilarly in this series, the Celtics failed to recognize the\r\nminuscule gaps they were allowing off pick and rolls were enough for\r\nCurry and co. to take full advantage with open 3 point looks. It took\r\nuntil mid-way through the third quarter before they finally started to\r\nbe aggressive defending any ball screen. Not long after that, the\r\nCeltics went on their exceptional run to finish convincing winners.\r\nExpect the Warriors to respond with a new strategy in game 2, most\r\nlikely with Curry setting more screens himself and then cutting to get\r\nopen, rather than receiving ball screens early in the offence.\r\nBody Language Matters\r\nUnfortunately the NBA coaching ranks continue to be populated by\r\nformer players rather than specialist coaches, leading to rookie\r\nmistakes a top high school coach would never make. Take Steve Kerr.\r\nDuring a time out in the third quarter with 5 minutes 19 on the clock,\r\nthe camera cut to a scene of him laughing and joking on the Warriors\r\nbench. This was when the Warriors were up 9. Presumably, Kerr was\r\nstarting to relax and perhaps subconsciously was slipping into a comfort\r\nzone. To describe this as amateurish is generous.\r\nLaughing in the third\r\nquarterWhile everyone can approach the game in their own way with their own\r\npersonality, Kerr’s body language and demeanor was completely different\r\nby the end of the fourth, suggesting he had lost focus and urgency\r\nearlier. Of course, by then it was too little, too late and the Warriors\r\nsuccumbed to the Celtics fightback. If this was a person who had trained\r\nas a coach, they would never have allowed a change in body language,\r\nwhich could affect the players drastically, even if not intentional.\r\nFocused and urgent - but too late in the\r\ndayCurry\r\nContinues to Excel, with Klay not far behind\r\nSteph Curry has a release time like no other player in the league.\r\nThe Celtics undoubtedly had prepared for him to shoot, but the tiny\r\nwindows within which Curry found himself open were enough to show how\r\ngenerational of a talent he is. That is not to discount the brilliance\r\nof Thompson and their partnership on the floor. Just take a look at this\r\nstunning score where Curry was that confident, he did not even need to\r\nlook when passing or when Klay was shooting. More to come.\r\nAl Horford and … Top Gun?\r\nTop Gun: MaverickTom Cruise and Top\r\nGun: Maverick showed us recently that old dogs really can produce\r\nsomething magical. By making a commitment to crafting something real by\r\nflying actual F-18s, Cruise showed that its never too late to do\r\nsomething extraordinary, and all it takes is care, commitment and hard\r\nwork. Al Horford has done the same. The veteran at 36 years of age\r\nscored 75% of his shots, nailing 6 of 8 three pointers in his first ever\r\nfinals appearance. This is after playing 141 playoff games throughout\r\nhis career without ever making it to the biggest stage.\r\nCelebrating against the\r\nWarriorsWe were then treated to his post match interview, in which he gave\r\nthanks, stayed humble and enjoyed the moment.\r\nAnd so, just like Top Gun 2, and nearly all good things in life,\r\nsometimes you have to wait, but what you wait for is excellent.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-06-04T19:11:12-04:00",
    "input_file": "key-takeaways-from-game-1.knit.md"
  },
  {
    "path": "posts/2022-06-02-misnomer-marcus-and-the-mystery-of-turnover-misery/",
    "title": "Misnomer Marcus and the Mystery of Turnover Misery",
    "description": "Marcus Smart may not be the NBA's most appropriately named player, but does it matter?",
    "author": [
      {
        "name": "Mike Toolan",
        "url": {}
      }
    ],
    "date": "2022-06-02",
    "categories": [],
    "contents": "\r\nThe Celtic’s Marcus Smart has not always shone through as the highest\r\nbasketball IQ player in the league. Some years ago, Shaquille O’Neal, in\r\nhis infamous Shaqtin’ a fool series, devoted an entire montage to his\r\nflopping antics. Our personal favourite is the Isiah Thomas\r\npiggyback:\r\n\r\n\r\nIn game 5 against the Bucks, he nearly single handedly ended the\r\nCeltics run to the NBA finals. With Boston leading by a single point in\r\nthis seemingly crucial game, Smart proceeded to turn an easy defensive\r\nrebound into a turnover, had a lay up blocked and dribbled right into a\r\nMilwaukee trap, handing them the ball in what was the game’s final\r\naction. All of this is even more impressive given that it was achieved\r\nwithin the final 14.2 seconds.\r\n\r\n\r\nThe final play in particular could easily have been avoided - spot\r\nthe trap, retreat dribble to create space and change the angle of attack\r\nvia a pass to the weak side. When Smart inbounded the ball, there was\r\n5.9 seconds on the clock - roughly translating to 6 dribbles before time\r\nexpires. However, when he turned it over, Smart had only taken 3\r\ndribbles but had continued to rush head first into a trap.\r\nStep 1: Count your dribbles to keep track\r\nof the clockStep 2: Identify the incoming trap and\r\nretreat dribble. Note how Matthews slip gives the Celtics a numerical\r\nadvantage on the weak sideAnd just like that, a slim Celtics lead, became a definite loss and\r\nthe need for a game 7 if they were to progress.\r\nSure Smart has made some mistakes and it cost them. But maybe the\r\nimportant take away is this: the Celtics won the series. Maybe\r\nnot despite Smart but because of him. To see his impact we need to go\r\nall the way back to the start of the season.\r\nSmart’s Season Story\r\nAfter an unimpressive start, the Celtics welcomed Chicago on November\r\nthe first. The Bulls’ record of 6 and 1 stood in stark contrast to the\r\nCeltics abysmal 2 and 5. A 14 point lead was blown and Smart had had\r\nenough. After the game, he criticized what is so often a feature of NBA\r\nplay - lone rangers failing to pass. Tatum and Brown in particular came\r\nin for scrutiny, with Smart remarking “They don’t want to pass the\r\nball”.\r\nFast forward a few months and Smart has noticed something. He\r\nremarked “…a change was starting” and the Celtics fortunes were\r\ncertainly looking up. Take a look at their running win percentage. The\r\nfirst vertical line is placed when Smart called out Brown and Tatum. The\r\nsecond is after their locker room change.\r\n\r\n\r\n\r\nThis renaissance was lead by Smart himself. In line with the Celtics\r\ngradual improvement, Smart has also followed this trend. By adjusting\r\nfor minutes played, we can see improvements in points, assists, field\r\ngoal percentage and offensive rebounds.\r\n\r\n\r\n\r\nSo why are we concerned about Smart’s mistakes? Even though some\r\nnumbers show a steady improvement, others have gone the other way. Take\r\nturnovers for instance. Before the January uptick in fortunes, Smart\r\naveraged 2 turnovers per game, adjusted for minutes played. Every game\r\nafter that? 2.6.\r\n\r\n\r\n\r\nSimilar trends are true of his defensive rebounds and blocks. Steals\r\nshow little change. So which effect dominates? Does his increased\r\nturnovers and lower production metrics cause the Celtics more harm than\r\nthe improvement in the positive side? Well its not so easy to say. The\r\ndata show that the Celtics are slightly less likely to win when Smart\r\nplays more minutes. That being said, his performance is highly\r\ncorrelated with the Celtics result. In other words if he performs well\r\nthey win, and if not, well you can surmise the rest.\r\nHis performance in game 1 of the finals bodes well. Especially when\r\nhe is given the opportunity to play simple, effective,\r\nintelligent basketball.\r\n\r\n\r\nKeep that up and the Celtics stand a chance.\r\n\r\n\r\n\r\n",
    "preview": "posts/2022-06-02-misnomer-marcus-and-the-mystery-of-turnover-misery/misnomer-marcus-and-the-mystery-of-turnover-misery_files/figure-html5/Win Percentage-1.png",
    "last_modified": "2022-06-04T15:29:24-04:00",
    "input_file": "misnomer-marcus-and-the-mystery-of-turnover-misery.knit.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Basketball Blog",
    "description": "Welcome to my blog where we outline the intersection of coaching science and basketball",
    "author": [
      {
        "name": "Mike Toolan",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2022-06-01",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-06-02T00:18:34-04:00",
    "input_file": {}
  }
]
