[
  {
    "path": "posts/2022-06-02-misnomer-marcus-and-the-mystery-of-turnover-misery/",
    "title": "Misnomer Marcus and the Mystery of Turnover Misery",
    "description": "Marcus Smart may not be the NBA's most appropriately named player, but does it matter?",
    "author": [
      {
        "name": "Zach Lowe",
        "url": {}
      }
    ],
    "date": "2022-06-02",
    "categories": [],
    "contents": "\r\nThe Celtic’s Marcus Smart has not always shone through as the highest\r\nbasketball IQ player in the league. Some years ago, Shaquille O’Neal, in\r\nhis infamous Shaqtin’ a fool series, devoted an entire montage to his\r\nflopping antics. Our personal favourite is the Isiah Thomas\r\npiggyback:\r\n\r\n\r\nIn game 5 against the Bucks, he nearly single handedly ended the\r\nCeltics run to the NBA finals. With Boston leading by a single point in\r\nthis seemingly crucial game, Smart proceeded to turn an easy defensive\r\nrebound into a turnover, had a lay up blocked and dribbled right into a\r\nMilwaukee trap, handing them the ball in what was the game’s final\r\naction. All of this is even more impressive given that it was achieved\r\nwithin the final 14.2 seconds.\r\n\r\n\r\nThe final play in particular could easily have been avoided - spot\r\nthe trap, retreat dribble to create space and change the angle of attack\r\nvia a pass to the weak side. When Smart inbounded the ball, there was\r\n5.9 seconds on the clock - roughly translating to 6 dribbles before time\r\nexpires. However, when he turned it over, Smart had only taken 3\r\ndribbles but had continued to rush head first into a trap.\r\nStep 1: Count your dribbles to keep track\r\nof the clockStep 2: Identify the incoming trap and\r\nretreat dribble. Note how Matthews slip gives the Celtics a numerical\r\nadvantage on the weak sideAnd just like that, a slim Celtics lead, became a definite loss and\r\nthe need for a game 7 if they were to progress.\r\nSure Smart has made some mistakes and it cost them. But maybe the\r\nimportant take away is this: the Celtics won the series. Maybe\r\nnot despite Smart but because of him. To see his impact we need to go\r\nall the way back to the start of the season.\r\nSmart’s Season Story\r\nAfter an unimpressive start, the Celtics welcomed Chicago on November\r\nthe first. The Bulls’ record of 6 and 1 stood in stark contrast to the\r\nCeltics abysmal 2 and 5. A 14 point lead was blown and Smart had had\r\nenough. After the game, he criticized what is so often a feature of NBA\r\nplay - lone rangers failing to pass. Tatum and Brown in particular came\r\nin for scrutiny, with Smart remarking “They don’t want to pass the\r\nball”.\r\nFast forward a few months and Smart has noticed something. He\r\nremarked “…a change was starting” and the Celtics fortunes were\r\ncertainly looking up. Take a look at their running win percentage. The\r\nfirst vertical line is placed when Smart called out Brown and Tatum. The\r\nsecond is after their locker room change.\r\n\r\n\r\n\r\nThis renaissance was lead by Smart himself. In line with the Celtics\r\ngradual improvement, Smart has also followed this trend. By adjusting\r\nfor minutes played, we can see improvements in points, assists, field\r\ngoal percentage and offensive rebounds.\r\n\r\n\r\n\r\nSo why are we concerned about Smart’s mistakes? Even though some\r\nnumbers show a steady improvement, others have gone the other way. Take\r\nturnovers for instance. Before the January uptick in fortunes, Smart\r\naveraged 2 turnovers per game, adjusted for minutes played. Every game\r\nafter that? 2.6.\r\n\r\n\r\n\r\nSimilar trends are true of his defensive rebounds and blocks. Steals\r\nshow little change. So which effect dominates? Does his increased\r\nturnovers and lower production metrics cause the Celtics more harm than\r\nthe improvement in the positive side? Well its not so easy to say. The\r\ndata show that the Celtics are slightly less likely to win when Smart\r\nplays more minutes. That being said, his performance is highly\r\ncorrelated with the Celtics result. In other words if he performs well\r\nthey win, and if not, well you can surmise the rest.\r\nHis performance in game 1 of the finals bodes well. Especially when\r\nhe is given the opportunity to play simple, effective,\r\nintelligent basketball.\r\n\r\n\r\nKeep that up and the Celtics stand a chance.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-06-03T20:00:24-04:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Basketball Blog",
    "description": "Welcome to my blog where we outline the intersection of coaching science and basketball",
    "author": [
      {
        "name": "Mike Toolan",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2022-06-01",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-06-02T00:18:34-04:00",
    "input_file": {}
  }
]
